/**
 * Напишите программу вывода всех четных чисел от 2 до 100 включительно
 */

public class EvenNumber {
    public static void main(String[] args) {
        int[] numbers = new int[101];
        for (int i = 1; i < numbers.length; i++) {
            if (i % 2 == 0);
            i++;
            System.out.print(i +" "+'\t');
        }
    }
}


